#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_rule.vm1http will be created
  + resource "azurerm_network_security_rule" "vm1http" {
      + access                      = "Allow"
      + destination_address_prefix  = "40.69.17.185"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Port_Internet_80"
      + network_security_group_name = "team1-nsg"
      + priority                    = 330
      + protocol                    = "Tcp"
      + resource_group_name         = "devops-training-team1"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.vm1.azurerm_virtual_machine.main will be created
  + resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "northeurope"
      + name                             = "team11-vm"
      + network_interface_ids            = [
          + "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team11-vm-nic",
        ]
      + resource_group_name              = "devops-training-team1"
      + tags                             = (known after apply)
      + vm_size                          = "Standard_B1ms"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "testadmin"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "team11-vmosdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.vm1.azurerm_virtual_machine_extension.main[0] will be created
  + resource "azurerm_virtual_machine_extension" "main" {
      + id                   = (known after apply)
      + location             = (known after apply)
      + name                 = "nginx"
      + protected_settings   = (sensitive value)
      + publisher            = "Microsoft.Azure.Extensions"
      + resource_group_name  = (known after apply)
      + tags                 = (known after apply)
      + type                 = "CustomScript"
      + type_handler_version = "2.0"
      + virtual_machine_id   = (known after apply)
      + virtual_machine_name = (known after apply)
    }

  # module.vm2.azurerm_virtual_machine.main will be created
  + resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "northeurope"
      + name                             = "team12-vm"
      + network_interface_ids            = [
          + "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team12-vm-nic",
        ]
      + resource_group_name              = "devops-training-team1"
      + tags                             = (known after apply)
      + vm_size                          = "Standard_B1ms"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "testadmin"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "team12-vmosdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.vm2.azurerm_virtual_machine_extension.main[0] will be created
  + resource "azurerm_virtual_machine_extension" "main" {
      + id                   = (known after apply)
      + location             = (known after apply)
      + name                 = "nginx"
      + protected_settings   = (sensitive value)
      + publisher            = "Microsoft.Azure.Extensions"
      + resource_group_name  = (known after apply)
      + tags                 = (known after apply)
      + type                 = "CustomScript"
      + type_handler_version = "2.0"
      + virtual_machine_id   = (known after apply)
      + virtual_machine_name = (known after apply)
    }

  # module.vm3.azurerm_virtual_machine.main will be created
  + resource "azurerm_virtual_machine" "main" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "northeurope"
      + name                             = "team13-vm"
      + network_interface_ids            = [
          + "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team13-vm-nic",
        ]
      + resource_group_name              = "devops-training-team1"
      + tags                             = (known after apply)
      + vm_size                          = "Standard_B1ms"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "testadmin"
          + computer_name  = "hostname"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "team13-vmosdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform validation`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./Oppgave1`*
